tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

brew "bat"
brew "git"
brew "lsd"
brew "httpie"
brew "htop"
brew "nvm"
brew "starship"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"


cask "1password"
cask "insomnia"
cask "1password-cli"
cask "android-studio"
cask "beekeeper-studio"
# cask "fig" TODO: Evaluate if it's necessary
cask "figma"
cask "firefox"
cask "firefox-developer-edition"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "github"
cask "gitify"
cask "google-chrome"
cask "google-chrome-dev"
cask "handbrake"
cask "hiddenbar"
cask "hyper"
cask "karabiner-elements"
cask "keepingyouawake"
cask "keycastr"
# cask "logi-options-plus" TODO: Find replacement
cask "mqtt-explorer"
cask "mqttx"
cask "obs"
cask "raycast"
cask "rectangle"
cask "safari-technology-preview"
cask "slack"
cask "stats"
cask "sourcetree"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
